<script setup lang="ts">

</script>

<template>
  <el-card class="service-container">
    <h1>深能科创软件服务条款</h1>
    <el-divider /><br>
    <div class="date">
      <span>最近更新：2023 年 8 月 27 日</span>
    </div>
    <h3>总则</h3>
    非常感谢您对珠海市晞云云科技有限公司深能科创团队（以下简称“深能科创”）的支持，为了保障您的权益，请您在使用深能科创软件前，仔细阅读并同意<strong>《深能科创软件服务条款》</strong>（以下简称“本条款”）。
    如在语言表述上存在歧义，以简体中文表述为准。您的使用行为将视为对本条款全部内容的认可。<br><br>
    请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、管辖与法律适用条款，以及开通或使用某项服务的单独协议。限制、免责条款可能以黑体加粗、加下划线或高亮的形式提示您重点注意。除非您已阅读并接受本协议所有条款，否则您无权使用深能科创提供的服务。您使用深能科创的服务即视为您已阅读并同意上述协议的约束。<br><br>
    如果您因为年龄，智力等因素而不完全具备民事行为能力，您应在法定监护人的陪同下阅读本协议，并在取得<strong>法定监护人</strong>的同意后使用深能科创的服务。<br><br>
    当您使用深能科创的服务时，即表示您已同意本协议的全部内容，本协议即在您与深能科创之间产生法律效力，成为对双方均具有约束力的法律文件。
    <strong>如果您违反本协议，深能科创团队有权随时中止或终止您对深能科创软件的使用资格（包括但不限于冻结、封禁账号）并保留追究相关法律责任的权利。</strong><br><br>

    <h3>账号与密码安全</h3>
    1. 您在使用深能科创的服务时可能需要注册一个账号。关于您使用深能科创的服务所需提供的注册信息，包括但不限于您的姓名、中华人民共和国二代身份证号、手机号码、电子邮箱、地址、邮政编码等个人信息，您应当保证其真实、完整、有效，并在相关资料实际变更时及时更新。<br>
    您的密码已经被 SHA256 不可逆的加密算法加密，深能科创不会以任何形式泄露您的密码，也不会向您索要密码。因此，您应当妥善保管您的账号和密码。您应当对您的账号和密码的安全负全部责任，且对您在该账号项下发生的所有行为负全部责任。<br>
    您的身份信息将用于深能科创的实名认证，深能科创软件将对您的身份信息进行严格保密，除中国人民共和国相关法律法规规定外，未经您的同意，深能科创不会向第三方公开、透露您的身份信息。<br><br>
    2. 您在注册账号时应当选择并维持一个有效的手机号码或者电子邮箱地址，以便深能科创团队与您进行有效联系。您应当对您的账号和密码的安全负全部责任，且对您在该账号项下发生的所有行为负全部责任。<br><br>
    3. 除身份验证外，深能科创工作人员不会向您索要您的账号密码和验证码，请您不要相信任何向您索要账号密码和验证码的信息，否则由此造成的损失由您自行承担。<br><br>
    4. 您不得将账号、密码转让、出借、出租或者售卖给他人使用。如您发现账号遭他人非法使用，应立即通知深能科创团队。因主动泄露行为或您的保管疏忽导致账号、密码遭他人非法使用的，深能科创不承担任何责任。<br><br>
    5. 深能科创有权根据实际情况中止或终止您的账号。<br><br>

    <h3>用户行为规范</h3>
    1. 您在使用深能科创的服务时应遵守中华人民共和国相关法律法规的规定，不得利用深能科创的服务从事任何违法违规行为，包括但不限于：<br>
    （1）发布、传送、传播、储存违法、违规、淫秽、诽谤、侮辱、威胁、破坏性、不实、侵害他人知识产权、人身权、财产权等合法权益或者其他有害信息或者言论；<br>
    （2）发布、传送、传播广告信息及垃圾信息；<br>
    （3）进行任何可能对互联网或移动网正常运转造成不利影响的行为；<br>
    （4）发布<strong>违反国家法律法规</strong>、政策规定的信息、煽动抗拒、破坏宪法和法律、行政法规实施的信息；<br>
    （5）对深能科创进行任何形式的攻击和干扰（包括但不限于 DDoS、CC 攻击、渗透等）；<br><br>
    2. 您在使用深能科创的服务时应遵守本条款及深能科创的其他服务条款的规定，不得利用深能科创的服务从事任何违反本条款及其他服务条款的行为。<br><br>
    3. 您在使用深能科创的服务时应遵守互联网道德，不得利用深能科创的服务从事任何损害互联网或移动网的正常运营秩序的行为。<br><br>

    <h3>服务内容</h3>
    1. 您有权在深能科创的软件上浏览深能科创的产品信息、使用深能科创的产品、参加深能科创的活动等。<br><br>
    2. 您有权获得在符合条件和规定内的<strong>全部服务和福利</strong>（包括但不限于开发者奖励、学生优惠等）。<br><br>
    3. 您有权在深能科创的软件上发布、传播、分享开放的信息，包括但不限于文字、图片、视频、音频等。<br><br>

    <h3>条款修改与服务变更</h3>
    1. <strong>深能科创有权在必要时修改本条款</strong>。您可以在深能科创的软件上查阅最新版本的条款。<br><br>
    2. 本条款修改后，如果您继续使用深能科创的服务，即视为您已接受修改后的条款。如果您不接受修改后的条款，应当停止使用深能科创的服务。<br><br>
    3. 深能科创有权在必要时修改、中止或终止深能科创的服务，包括但不限于：<br>
    （1）深能科创的服务内容发生变化；<br>
    （2）深能科创的软件发生变化；<br>
    （3）深能科创的上游服务发生变化；<br>
    （4）国家、地方政策发生变化；<br>
    （5）其他深能科创认为需要变更、中止或终止服务的情况。<br><br>
    4. 深能科创始终在不断完善服务，增加功能或完善修改，您理解并同意深能科创有权在必要时中止或终止部分服务，深能科创将在中止或终止服务前通知您。<br><br>

    <h3>知识产权</h3>
    1. 深能科创的软件包括但不限于深能科创的网站、客户端、移动端等，深能科创的软件的所有权、运营权、管理权均属于深能科创团队。<br><br>
    2. 深能科创的软件上的所有内容，包括但不限于文字、图片、图形、音频、视频、软件、程序、代码、用户界面以及版面设计、结构、安排、数据库等均由深能科创团队或相关权利人依法拥有知识产权，包括但不限于著作权、商标权、专利权等。<br><br>
    3. 未经深能科创团队或相关权利人书面同意，您不得以任何方式擅自使用、修改、复制、传播、改变、散布、发行或公开展示深能科创的软件上的任何内容，或者制作其衍生作品，或者以商业目的使用深能科创的软件上的任何内容。<br><br>
    4. 您在使用深能科创的服务时，应当保证不侵犯深能科创团队或相关权利人的知识产权，不得以任何方式侵犯深能科创团队或相关权利人的知识产权。<br><br>

    请您遵守 <a href="https://github.com/zmh-program/Deeptrain/blob/main/LICENSE" target="_blank">GPL-3.0</a> 协议，不得以任何方式侵犯深能科创团队或相关权利人的知识产权，不得以任何违反本条款的方式使用和分发深能科创的软件。<br><br>

    <h3>联系我们</h3>
    如果您对本条款有任何疑问，可以通过以下方式联系我们：<br><br>
    &nbsp;&nbsp;&nbsp;&nbsp;Github: <a href="https://github.com/deeptrain-community" target="_blank">Deeptrain Community</a> <br>
    &nbsp;&nbsp;&nbsp;&nbsp;QQ 群：<a href="http://qm.qq.com/cgi-bin/qm/qr?_wv=1027&k=lNrkq-3qTKgnPV7HWks5qLi5lUwydEe2&authKey=hw2DPzt4PcVCI%2FSTMT%2B%2BqiqLUki0Ze7mitqGcYe%2BLzq50q3NRu5TAocDUUog%2FZXL&noverify=0&group_code=565902327">Deeptrain 社区</a><br>
    &nbsp;&nbsp;&nbsp;&nbsp;邮箱：<a href="mailto:postmaster@lightxi.com">postmaster@lightxi.com</a>
    <br><br><br>
    <strong>深能科创团队保留对本条款的最终解释权。</strong><br><br>
    <div class="sign">
      <span>顺祝商祺</span>
      <span>Deeptrain 团队</span>
    </div>
  </el-card>
</template>

<style scoped>
@import "@/assets/style/service.css";
</style>
